erp3l/src/Catalogs/СчетаУчетаКурсовыхРазниц/СчетаУчетаКурсовыхРазниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетаУчетаКурсовыхРазниц</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибыли</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибылиСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибылиСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПрибылиСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаУбытка</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаУбыткаСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаУбыткаСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаУбыткаСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/СчетаУчетаКурсовыхРазниц/ManagerModule.bsl
#Область ИменаСубконто

Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаПрибылиСубконто1");
	Субконто.Вставить(2, "СчетУчетаПрибылиСубконто2");
	Субконто.Вставить(3, "СчетУчетаПрибылиСубконто3");
	
	Результат.Вставить("СчетУчетаПрибыли", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаУбыткаСубконто1");
	Субконто.Вставить(2, "СчетУчетаУбыткаСубконто2");
	Субконто.Вставить(3, "СчетУчетаУбыткаСубконто3");
	
	Результат.Вставить("СчетУчетаУбытка", Субконто);
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
